If true style has deformed shape settings.
  Namespace:   Autodesk.Revit.DB.Analysis
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2013
 Syntax
  C#
public bool HasDeformedShapeSettings()
  Visual Basic
Public Function HasDeformedShapeSettings As Boolean
  Visual C++
public:
bool HasDeformedShapeSettings()
 See Also
  AnalysisDisplayStyle Class
  Autodesk.Revit.DB.Analysis Namespace